sugarcrm-connector-test/src/test/resources/artifacts/ESB/config/soapRequests/sugarcrm/setDocumentRevision.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sug="wso2.connector.sugarcrm.setdocumentrevision">
   <soapenv:Header/>
   <soapenv:Body>
      <sug:sugarCRMApiUrl>https://ypbvhe6054.trial.sugarcrm.com/soap.php</sug:sugarCRMApiUrl>    	
   	<sug:session>be0mc58ko3mcjhcfbj3jqasi16</sug:session>
   	<sug:note>
   		<sug:noteId>12</sug:noteId>
   		<sug:fileContent>0000-0010:  43 72 65 61-74 65 20 43-6f 6e 6e 65-63 74 6f 72  Create.C onnector
0000-0020:  20 3a 0d 0a-6d 76 6e 20-61 72 63 68-65 74 79 70  .:..mvn. archetyp
0000-0030:  65 3a 67 65-6e 65 72 61-74 65 20 2d-44 61 72 63  e:genera te.-Darc
0000-0040:  68 65 74 79-70 65 47 72-6f 75 70 49-64 3d 6f 72  hetypeGr oupId=or
0000-0050:  67 2e 77 73-6f 32 2e 63-61 72 62 6f-6e 20 2d 44  g.wso2.c arbon.-D
0000-0060:  61 72 63 68-65 74 79 70-65 41 72 74-69 66 61 63  archetyp eArtifac
0000-0070:  74 49 64 3d-6f 72 67 2e-77 73 6f 32-2e 63 61 72  tId=org. wso2.car
0000-0080:  62 6f 6e 2e-6d 65 64 69-61 74 69 6f-6e 2e 6c 69  bon.medi ation.li
0000-0090:  62 72 61 72-79 2e 63 6f-6e 6e 65 63-74 6f 72 73  brary.co nnectors
0000-00a0:  2e 63 6f 6e-6e 65 63 74-6f 72 2d 61-72 63 68 65  .connect or-arche
0000-00b0:  74 79 70 65-20 2d 44 61-72 63 68 65-74 79 70 65  type.-Da rchetype
0000-00c0:  56 65 72 73-69 6f 6e 3d-34 2e 32 2e-30 20 2d 44  Version= 4.2.0.-D
0000-00d0:  67 72 6f 75-70 49 64 3d-6f 72 67 2e-77 73 6f 32  groupId= org.wso2
0000-00e0:  2e 63 61 72-62 6f 6e 2e-63 6f 6e 6e-65 63 74 6f  .carbon. connecto
0000-00f0:  72 20 2d 44-61 72 74 69-66 61 63 74-49 64 3d 6f  r.-Darti factId=o
0000-0100:  72 67 2e 77-73 6f 32 2e-63 61 72 62-6f 6e 2e 63  rg.wso2. carbon.c
0000-0110:  6f 6e 6e 65-63 74 6f 72-20 2d 44 76-65 72 73 69  onnector .-Dversi
0000-0118:  6f 6e 3d 34-2e 32 2e 30                          on=4.2.0</sug:fileContent>
   		<sug:fileName>sugarTestFileToBinary.txt</sug:fileName>
   		<sug:revision>1</sug:revision>
   	</sug:note>
   </soapenv:Body>
</soapenv:Envelope>